In [4]:
# Create a DataFrame from a dictionary

import numpy as np
import pandas as pd

my_dict={"name":["khadeeja","faris","navas"],
         "age":np.array([22,18,44])}
df=pd.DataFrame(my_dict)
df

       name  age
0  khadeeja   22
1     faris   18
2     navas   44

In [5]:
df2=pd.DataFrame(my_dict,index=my_dict["name"])
df2

              name  age
khadeeja  khadeeja   22
faris        faris   18
navas        navas   44

In [7]:
# get a Column by name
df2["age"]
df2.age

khadeeja    22
faris       18
navas       44
Name: age, dtype: int64

In [8]:
# Delete a Column
del df2["age"]

In [9]:
# Add New Column
df2['IQ']=[130,145,170]
df2

              name   IQ
khadeeja  khadeeja  130
faris        faris  145
navas        navas  170

In [10]:
# Select row khadeeja
df2.loc['khadeeja']

name    khadeeja
IQ           130
Name: khadeeja, dtype: object

In [11]:
df2.loc['khadeeja','IQ']

np.int64(130)

In [12]:
# Slice by Label
df2.loc['khadeeja':'navas','name':'IQ']

              name   IQ
khadeeja  khadeeja  130
faris        faris  145
navas        navas  170

In [16]:
df2.iloc[0]  # Get row 0

name    khadeeja
IQ           130
Name: khadeeja, dtype: object

In [17]:
# Get row 0 and Column 1
df2.iloc[0,1]

np.int64(130)

In [19]:
boolean_index=[False,True,True]  # Here Row 0 is False and Other rows are true
df2[boolean_index]

        name   IQ
faris  faris  145
navas  navas  170

In [20]:
# Comaprison
boolean_index=df2["IQ"]>150
df2[boolean_index]

        name   IQ
navas  navas  170